In [1]:
import numpy as np

In [2]:
import pandas as pd

## Object creation

Creating a Series by passing a list of values, letting pandas create a default integer index:

In [3]:
s = pd.Series([1,2,3,np.nan,6,8])

In [4]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    6.0
5    8.0
dtype: float64

Creating a DataFrame by passing a NumPy array, with a datetime index and labeled columns:

In [5]:
dates = pd.date_range("20130101", periods=6)

In [6]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df  = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))

In [8]:
df

                   A         B         C         D
2013-01-01 -0.399044 -0.096472  0.735241 -0.449949
2013-01-02  0.986210  0.555148 -0.162333  0.162403
2013-01-03  1.205087 -0.907975  0.984994 -0.926545
2013-01-04 -0.384241  1.156443  1.804752  0.544373
2013-01-05 -0.052957  0.197152 -1.268963  0.301602
2013-01-06  0.607672 -0.937031  0.180967  0.972101

Creating a DataFrame by passing a dict of objects that can be converted to series-like.

In [13]:
df2 = pd.DataFrame(
{
    "A":1.0,
    "B":pd.Timestamp("20120127"),
    "C":pd.Series(1,index=list(range(4)), dtype='float32'),
    "D":np.array([3]*4,dtype="int32"),
    "E":pd.Categorical(["test", "train","test", "train"]),
    "F":"foo",
})

In [14]:
df2

     A          B    C  D      E    F
0  1.0 2012-01-27  1.0  3   test  foo
1  1.0 2012-01-27  1.0  3  train  foo
2  1.0 2012-01-27  1.0  3   test  foo
3  1.0 2012-01-27  1.0  3  train  foo

The columns of the resulting DataFrame have different dtypes.

In [16]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Viewing data

Here is how to view the top and bottom rows of the frame:

In [18]:
df.head()

                   A         B         C         D
2013-01-01 -0.399044 -0.096472  0.735241 -0.449949
2013-01-02  0.986210  0.555148 -0.162333  0.162403
2013-01-03  1.205087 -0.907975  0.984994 -0.926545
2013-01-04 -0.384241  1.156443  1.804752  0.544373
2013-01-05 -0.052957  0.197152 -1.268963  0.301602

In [19]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.384241  1.156443  1.804752  0.544373
2013-01-05 -0.052957  0.197152 -1.268963  0.301602
2013-01-06  0.607672 -0.937031  0.180967  0.972101

Display the index, columns:

In [20]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [21]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

##  NumPy arrays have one dtype for the entire array, while pandas DataFrames have one dtype per column.

For df, our DataFrame of all floating-point values, DataFrame.to_numpy() is fast and doesn’t require copying data.

In [22]:
df.to_numpy()

array([[-0.39904409, -0.09647164,  0.73524142, -0.44994923],
       [ 0.98620961,  0.55514758, -0.16233281,  0.16240349],
       [ 1.20508747, -0.90797463,  0.98499444, -0.92654459],
       [-0.38424094,  1.15644309,  1.80475214,  0.54437309],
       [-0.05295704,  0.1971516 , -1.26896316,  0.30160205],
       [ 0.60767206, -0.93703143,  0.18096691,  0.97210113]])

For df2, the DataFrame with multiple dtypes, DataFrame.to_numpy() is relatively expensive.

## Note

DataFrame.to_numpy() does not include the index or column labels in the output.

In [23]:
df2.to_numpy()

array([[1.0, Timestamp('2012-01-27 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2012-01-27 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2012-01-27 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2012-01-27 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

describe() shows a quick statistic summary of your data:

In [24]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.327121 -0.005456  0.379110  0.100664
std    0.701676  0.824135  1.055931  0.686848
min   -0.399044 -0.937031 -1.268963 -0.926545
25%   -0.301420 -0.705099 -0.076508 -0.296861
50%    0.277358  0.050340  0.458104  0.232003
75%    0.891575  0.465649  0.922556  0.483680
max    1.205087  1.156443  1.804752  0.972101

Transposing your data:

In [25]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.399044    0.986210    1.205087   -0.384241   -0.052957    0.607672
B   -0.096472    0.555148   -0.907975    1.156443    0.197152   -0.937031
C    0.735241   -0.162333    0.984994    1.804752   -1.268963    0.180967
D   -0.449949    0.162403   -0.926545    0.544373    0.301602    0.972101

Sorting by an axis:

In [26]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.449949  0.735241 -0.096472 -0.399044
2013-01-02  0.162403 -0.162333  0.555148  0.986210
2013-01-03 -0.926545  0.984994 -0.907975  1.205087
2013-01-04  0.544373  1.804752  1.156443 -0.384241
2013-01-05  0.301602 -1.268963  0.197152 -0.052957
2013-01-06  0.972101  0.180967 -0.937031  0.607672

Sorting by values:

In [27]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-06  0.607672 -0.937031  0.180967  0.972101
2013-01-03  1.205087 -0.907975  0.984994 -0.926545
2013-01-01 -0.399044 -0.096472  0.735241 -0.449949
2013-01-05 -0.052957  0.197152 -1.268963  0.301602
2013-01-02  0.986210  0.555148 -0.162333  0.162403
2013-01-04 -0.384241  1.156443  1.804752  0.544373

## Selection

Selecting a single column, which yields a Series, equivalent to df.A:

In [28]:
df["A"]

2013-01-01   -0.399044
2013-01-02    0.986210
2013-01-03    1.205087
2013-01-04   -0.384241
2013-01-05   -0.052957
2013-01-06    0.607672
Freq: D, Name: A, dtype: float64

Selecting via [], which slices the rows.

In [29]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.399044 -0.096472  0.735241 -0.449949
2013-01-02  0.986210  0.555148 -0.162333  0.162403
2013-01-03  1.205087 -0.907975  0.984994 -0.926545

In [30]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  0.986210  0.555148 -0.162333  0.162403
2013-01-03  1.205087 -0.907975  0.984994 -0.926545
2013-01-04 -0.384241  1.156443  1.804752  0.544373

## Selection by label

For getting a cross section using a label:

In [31]:
df.loc[dates[0]]

A   -0.399044
B   -0.096472
C    0.735241
D   -0.449949
Name: 2013-01-01 00:00:00, dtype: float64

Selecting on a multi-axis by label:

In [33]:
df.loc[:,["A","B"]

                   A         B
2013-01-01 -0.399044 -0.096472
2013-01-02  0.986210  0.555148
2013-01-03  1.205087 -0.907975
2013-01-04 -0.384241  1.156443
2013-01-05 -0.052957  0.197152
2013-01-06  0.607672 -0.937031

Showing label slicing, both endpoints are included:

In [34]:
 df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02  0.986210  0.555148
2013-01-03  1.205087 -0.907975
2013-01-04 -0.384241  1.156443

Reduction in the dimensions of the returned object:

In [35]:
df.loc["20130102", ["A", "B"]]

A    0.986210
B    0.555148
Name: 2013-01-02 00:00:00, dtype: float64

For getting a scalar value:

In [36]:
df.loc[dates[0], "A"]

-0.3990440935150428

In [37]:
df.at[dates[0], "A"]

-0.3990440935150428

## Selection by position

Select via the position of the passed integers:

In [38]:
df.iloc[3]

A   -0.384241
B    1.156443
C    1.804752
D    0.544373
Name: 2013-01-04 00:00:00, dtype: float64

By integer slices, acting similar to NumPy/Python:

In [39]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.384241  1.156443
2013-01-05 -0.052957  0.197152

By lists of integer position locations, similar to the NumPy/Python style:

In [40]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.986210 -0.162333
2013-01-03  1.205087  0.984994
2013-01-05 -0.052957 -1.268963

For slicing rows explicitly:

In [42]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.986210  0.555148 -0.162333  0.162403
2013-01-03  1.205087 -0.907975  0.984994 -0.926545

For slicing columns explicitly:

In [43]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.096472  0.735241
2013-01-02  0.555148 -0.162333
2013-01-03 -0.907975  0.984994
2013-01-04  1.156443  1.804752
2013-01-05  0.197152 -1.268963
2013-01-06 -0.937031  0.180967

For getting a value explicitly:

In [44]:
df.iloc[1, 1]

0.5551475816439467

For getting fast access to a scalar (equivalent to the prior method):

In [45]:
df.iat[1, 1]

0.5551475816439467

# Boolean indexing

Using a single column’s values to select data.

In [46]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-02  0.986210  0.555148 -0.162333  0.162403
2013-01-03  1.205087 -0.907975  0.984994 -0.926545
2013-01-06  0.607672 -0.937031  0.180967  0.972101

Selecting values from a DataFrame where a boolean condition is met.

In [47]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN  0.735241       NaN
2013-01-02  0.986210  0.555148       NaN  0.162403
2013-01-03  1.205087       NaN  0.984994       NaN
2013-01-04       NaN  1.156443  1.804752  0.544373
2013-01-05       NaN  0.197152       NaN  0.301602
2013-01-06  0.607672       NaN  0.180967  0.972101

Using the isin() method for filtering:

In [48]:
df2 = df.copy()

In [49]:
df2["E"] = ["one", "one", "two", "three", "four", "three"]

In [50]:
df2

                   A         B         C         D      E
2013-01-01 -0.399044 -0.096472  0.735241 -0.449949    one
2013-01-02  0.986210  0.555148 -0.162333  0.162403    one
2013-01-03  1.205087 -0.907975  0.984994 -0.926545    two
2013-01-04 -0.384241  1.156443  1.804752  0.544373  three
2013-01-05 -0.052957  0.197152 -1.268963  0.301602   four
2013-01-06  0.607672 -0.937031  0.180967  0.972101  three

In [51]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03  1.205087 -0.907975  0.984994 -0.926545   two
2013-01-05 -0.052957  0.197152 -1.268963  0.301602  four

## Setting

Setting a new column automatically aligns the data by the indexes.

In [54]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

In [55]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [60]:
df["F"] = s1

The result of the prior setting operations.

In [61]:
df

                   A         B         C         D    F
2013-01-01 -0.399044 -0.096472  0.735241 -0.449949  NaN
2013-01-02  0.986210  0.555148 -0.162333  0.162403  1.0
2013-01-03  1.205087 -0.907975  0.984994 -0.926545  2.0
2013-01-04 -0.384241  1.156443  1.804752  0.544373  3.0
2013-01-05 -0.052957  0.197152 -1.268963  0.301602  4.0
2013-01-06  0.607672 -0.937031  0.180967  0.972101  5.0

## Missing data

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

In [62]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

In [63]:
df1.loc[dates[0] : dates[1], "E"] = 1

In [64]:
df1

                   A         B         C         D    F    E
2013-01-01 -0.399044 -0.096472  0.735241 -0.449949  NaN  1.0
2013-01-02  0.986210  0.555148 -0.162333  0.162403  1.0  1.0
2013-01-03  1.205087 -0.907975  0.984994 -0.926545  2.0  NaN
2013-01-04 -0.384241  1.156443  1.804752  0.544373  3.0  NaN

To drop any rows that have missing data.

In [65]:
df1.dropna(how="any")

                  A         B         C         D    F    E
2013-01-02  0.98621  0.555148 -0.162333  0.162403  1.0  1.0

Filling missing data.

In [66]:
df1.fillna(value=5)

                   A         B         C         D    F    E
2013-01-01 -0.399044 -0.096472  0.735241 -0.449949  5.0  1.0
2013-01-02  0.986210  0.555148 -0.162333  0.162403  1.0  1.0
2013-01-03  1.205087 -0.907975  0.984994 -0.926545  2.0  5.0
2013-01-04 -0.384241  1.156443  1.804752  0.544373  3.0  5.0